In [1]:
import pandas as pd

In [3]:
products = {
    "product_id": [1, 2, 3, 4],
    "product_name": ["Laptop", "Tablet", "Smartphone", "Smartwatch"],
    "category": ["Electronics", "Electronics", "Electronics", "Wearables"],
    "price": [1200, 300, 800, 250],
}
df_products = pd.DataFrame(products)


order_details = {
    "order_id": [101, 102, 103, 104, 105, 106, 107],
    "product_id": [2, 2, 1, 2, 4, 1, 5],
    "customer_id": [201, 202, 202, 204, 203, 201, 202],
    "quantity": [1, 2, 1, 3, 2, 2, 4],
}
df_order_details = pd.DataFrame(order_details)

In [9]:
inner_jo = df_order_details.merge(df_products, on="product_id", how="inner")

In [10]:
inner_jo.product_name.unique()

array(['Tablet', 'Laptop', 'Smartwatch'], dtype=object)

#### Products which have been ordered: 'Tablet', 'Laptop', 'Smartwatch'.

#### Product which has not been ordered: `Smartphone`.

In [11]:
left_j = df_order_details.merge(df_products, on="product_id", how="left")

In [12]:
left_j

,order_id,product_id,customer_id,quantity,product_name,category,price
0,101,2,201,1,Tablet,Electronics,300.0
1,102,2,202,2,Tablet,Electronics,300.0
2,103,1,202,1,Laptop,Electronics,1200.0
3,104,2,204,3,Tablet,Electronics,300.0
4,105,4,203,2,Smartwatch,Wearables,250.0
5,106,1,201,2,Laptop,Electronics,1200.0
6,107,5,202,4,NaN,NaN,NaN

In [20]:
df_products[~df_products.product_id.isin(left_j.product_id.unique())]

   product_id product_name     category  price
2           3   Smartphone  Electronics    800

#### Product id which missing in df_products â€” 5.

In [22]:
outer_j = df_order_details.merge(df_products, on="product_id", how="outer")

In [36]:
outer_j

,order_id,product_id,customer_id,quantity,product_name,category,price
0,103.0,1,202.0,1.0,Laptop,Electronics,1200.0
1,106.0,1,201.0,2.0,Laptop,Electronics,1200.0
2,101.0,2,201.0,1.0,Tablet,Electronics,300.0
3,102.0,2,202.0,2.0,Tablet,Electronics,300.0
4,104.0,2,204.0,3.0,Tablet,Electronics,300.0
5,NaN,3,NaN,NaN,Smartphone,Electronics,800.0
6,105.0,4,203.0,2.0,Smartwatch,Wearables,250.0
7,107.0,5,202.0,4.0,NaN,NaN,NaN

In [34]:
outer_j[~outer_j.product_id.isin(df_products.product_id.unique())]

   order_id  product_id  customer_id  quantity product_name category  price
7     107.0           5        202.0       4.0          NaN      NaN    NaN